Redmap_To_Fusion/Files/RM_FU/Fusion/COARules/Request/SupplierDetailsReportSampleRequest.xml

<?xml version="1.0" encoding="ISO-8859-1" standalone="no" ?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:app1="http://xmlns.oracle.com/oxp/service/PublicReportService" xmlns:ns1="http://xmlns.oracle.com/oxp/service/PublicReportService" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<app1:runReport>
			<app1:reportRequest>
				<app1:attributeFormat>csv</app1:attributeFormat>
				<app1:flattenXML>true</app1:flattenXML>
				<app1:reportAbsolutePath>/Custom/Integration/Reports/MSS Related Values.xdo</app1:reportAbsolutePath>
				<app1:sizeOfDataChunkDownload>-1</app1:sizeOfDataChunkDownload>
				<app1:parameterNameValues>
					<app1:item>
						<app1:name>p_from_date</app1:name>
						<app1:values>
							<app1:item>2020-04-01</app1:item>
						</app1:values>
					</app1:item>
				</app1:parameterNameValues>
			</app1:reportRequest>
		</app1:runReport>
	</soap:Body>
</soap:Envelope>